Revit 2024 API
ParameterTypeId.FabricationPartLength Property
 "Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationPartLength { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationPartLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace